Reports/ОтчётПоПринятымИПропущеннымЗвонкамТелефонаДоверия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>ОтчётПоПринятымИПропущеннымЗвонкамТелефонаДоверия</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТаблицаЗвонков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КвоПринятыхЗвонков</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КвоПропущенныхЗвонков</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КатегорияТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодДень</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодЧас</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/ОтчётПоПринятымИПропущеннымЗвонкамТелефонаДоверия/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	//Возврат;
	
	СтандартнаяОбработка = Ложь;
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	Период = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период")).Значение;
	ДатаНачала = Период.ДатаНачала; ДатаОкончания = Период.ДатаОкончания;
	Если НЕ ЗначениеЗаполнено(ДатаНачала) ИЛИ НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрКД = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВремяС"));
	ВремяС = ?(ПараметрКД.Использование, ПараметрКД.Значение, Неопределено);
	
	ПараметрКД = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВремяПо"));
	ВремяПо = ?(ПараметрКД.Использование, ПараметрКД.Значение, Неопределено);
	
	СписокНомеров = Новый СписокЗначений;
	СтруктураНомеров = Новый Структура("НомераТелефонаДоверия", "Телефон доверия");
	Для Каждого КлючИЗначение Из СтруктураНомеров Цикл
		
		ПараметрКД = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(КлючИЗначение.Ключ));
		Если НЕ ПараметрКД.Использование ИЛИ НЕ ЗначениеЗаполнено(ПараметрКД.Значение) Тогда Продолжить; КонецЕсли;
		
		МассивНомеров = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ПараметрКД.Значение, ",");
		Для Каждого Номер Из МассивНомеров Цикл
			НомерТелефона = АК_ТелефонияСервер.ОчиститьНомерТелефона(Номер);
			Если СписокНомеров.НайтиПоЗначению(НомерТелефона) = Неопределено Тогда
				СписокНомеров.Добавить(НомерТелефона, КлючИЗначение.Значение);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Если СписокНомеров.Количество() = 0 Тогда Возврат; КонецЕсли;
	
	ТЗнЗвонков = ЗаполнитьТЗнЗвонков(ДатаНачала, ДатаОкончания, СписокНомеров, ВремяС, ВремяПо);
	
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	// Сформируем структуру внешних данных
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТЗнЗвонков", ТЗнЗвонков); //ТаблицаЗвонков.Выгрузить());
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	// Инициализируем процессор СКД
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	// Инициализируем процессор вывода
	ДокументРезультат.Очистить();
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьТЗнЗвонков(ДатаНачала, ДатаОкончания, СписокНомеров, ВремяС, ВремяПо) Экспорт
	
	ТЗнЗвонков = Новый ТаблицаЗначений;
	ТЗнЗвонков.Колонки.Добавить("Дата");
	ТЗнЗвонков.Колонки.Добавить("ПериодДень");
	ТЗнЗвонков.Колонки.Добавить("ПериодЧас");
	ТЗнЗвонков.Колонки.Добавить("КатегорияТелефона");
	ТЗнЗвонков.Колонки.Добавить("НомерТелефона");
	ТЗнЗвонков.Колонки.Добавить("ИсходящийПредставление");
	ТЗнЗвонков.Колонки.Добавить("ВидНедозвона");
	ТЗнЗвонков.Колонки.Добавить("КаналСвязи"); //+++АК SHEP 2018.01.17 ИП-00017665
	ТЗнЗвонков.Колонки.Добавить("Длительность");
	//+++АК SHEP 2018.02.02 ИП-00017665.03
	ТЗнЗвонков.Колонки.Добавить("ДлительностьИсходящего");
	ТЗнЗвонков.Колонки.Добавить("ВходящийПредставление");
	//---АК SHEP 2018.02.02
	ТЗнЗвонков.Колонки.Добавить("КвоПринятыхЗвонков");
	ТЗнЗвонков.Колонки.Добавить("КвоПропущенныхЗвонков");
	ТЗнЗвонков.Колонки.Добавить("Неотвеченный");
	ТЗнЗвонков.Колонки.Добавить("СтатусЗвонка");
	
	ОтборНомераТелефона = "";
	Для Каждого НомерТелефона Из СписокНомеров Цикл
		ОтборНомераТелефона = ОтборНомераТелефона + НомерТелефона.Значение + ",";
	КонецЦикла;
	Если СтрДлина(ОтборНомераТелефона) > 0 Тогда ОтборНомераТелефона = Лев(ОтборНомераТелефона, СтрДлина(ОтборНомераТелефона) - 1); КонецЕсли;
	
	ТЗн = ПрочитатьЛогAsterisk(ДатаНачала, ДатаОкончания, ОтборНомераТелефона,, ВремяС, ВремяПо);
	
	МассивПолейДляПоиска = Новый Массив;
	//МассивПолейДляПоиска.Добавить("src");
	МассивПолейДляПоиска.Добавить("did");
	
	Для Каждого СтрокаТЗн Из ТЗн Цикл
		
		Для Каждого ПолеДляПоиска Из МассивПолейДляПоиска Цикл
			НомерТелефона = СокрЛП(СтрокаТЗн[ПолеДляПоиска]);
			
			//+++АК SHEP 2018.02.05 ИП-00017665.03
			//ЭлементСписка = СписокНомеров.НайтиПоЗначению(НомерТелефона);
			//Если ЭлементСписка = Неопределено Тогда Продолжить; КонецЕсли;
			ЭлементСписка = СписокНомеров[0];
			//---АК SHEP 2018.02.05
			
			НоваяСтрокаТЗнЗвонков = ТЗнЗвонков.Добавить();
			НоваяСтрокаТЗнЗвонков.Дата = СтрокаТЗн.calldate;
			НоваяСтрокаТЗнЗвонков.ПериодДень = НачалоДня(СтрокаТЗн.calldate);
			НоваяСтрокаТЗнЗвонков.ПериодЧас = НачалоЧаса(СтрокаТЗн.calldate);
			НоваяСтрокаТЗнЗвонков.КатегорияТелефона = ЭлементСписка.Представление;
			НоваяСтрокаТЗнЗвонков.НомерТелефона = НомерТелефона;
			НоваяСтрокаТЗнЗвонков.ИсходящийПредставление = СтрокаТЗн.ИсходящийПредставление;
			НоваяСтрокаТЗнЗвонков.ВидНедозвона = СтрокаТЗн.disposition;
			НоваяСтрокаТЗнЗвонков.КаналСвязи = СтрокаТЗн.dstchannel; //+++АК SHEP 2018.01.17 ИП-00017665
			НоваяСтрокаТЗнЗвонков.Длительность = СтрокаТЗн.Duration; //+++АК SHEP 2018.01.25 ИП-00017665.02
			//+++АК SHEP 2018.02.05 ИП-00017665.03
			НоваяСтрокаТЗнЗвонков.ДлительностьИсходящего = СтрокаТЗн.DurationOutput;
			НоваяСтрокаТЗнЗвонков.ВходящийПредставление = СтрокаТЗн.ВходящийПредставление;
			//---АК SHEP 2018.02.05
			НоваяСтрокаТЗнЗвонков.КвоПринятыхЗвонков = ?(НоваяСтрокаТЗнЗвонков.ВидНедозвона = "ANSWERED", 1, 0);
			НоваяСтрокаТЗнЗвонков.КвоПропущенныхЗвонков = 1 - НоваяСтрокаТЗнЗвонков.КвоПринятыхЗвонков;
			НоваяСтрокаТЗнЗвонков.Неотвеченный = (СтрокаТЗн.NotAnswered = 1);
			НоваяСтрокаТЗнЗвонков.СтатусЗвонка = ?(НоваяСтрокаТЗнЗвонков.Неотвеченный, "Недозвонившиеся", "Дозвонившиеся с " + (СтрокаТЗн.CallsQty + 1) + "-й попытки");
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТЗнЗвонков;
	
КонецФункции

Функция ПолучитьУсловиеМежду(Поле, НачальноеЗначение, КонечноеЗначение)
	Если Не ЗначениеЗаполнено(Поле) Тогда
		ВызватьИсключение "Поле для условия не указано";
	КонецЕсли;
	Возврат Поле + " BETWEEN " + ВнешниеДанные.ФорматПоля(НачальноеЗначение) + " AND " + ВнешниеДанные.ФорматПоля(КонечноеЗначение);
КонецФункции

&НаСервере
Функция ПрочитатьЛогAsterisk(НачалоПериода = Неопределено, КонецПериода = Неопределено, ОтборНомераТелефона = Неопределено, ТолькоНеотвеченые = Ложь, ВремяС = Неопределено, ВремяПо = Неопределено)
	
	ADOСоединение = ВнешниеДанные.ПолучитьADOСоединение("10.0.0.40");	
	
	//+++АК SHEP 2018.01.17 ИП-00017665: добавил канал связи (dstchannel) //---АК SHEP 2018.01.17
	ТекстЗапросаSQL =
		"IF OBJECT_ID('tempdb..#CallsHistory') IS NOT NULL DROP Table #CallsHistory
		|
		|IF OBJECT_ID('tempdb..#LastCalls') IS NOT NULL DROP Table #LastCalls
		|
		|SELECT
		|	CAST(calldate AS datetime) AS calldate,
		|	CASE WHEN LEN(src) < 10 THEN src ELSE '8' + RIGHT(src, 10) END AS src, 
		|	CASE WHEN LEN(dst) < 10 THEN dst ELSE '8' + RIGHT(dst, 10) END AS dst,
		|	CASE WHEN LEN(did) < 10 THEN did ELSE '8' + RIGHT(did, 10) END AS did,
		|	CASE WHEN ISNULL(did, '') = '' THEN src ELSE SUBSTRING(dstchannel, 5, 4) END AS dstchannel,
		|	CASE WHEN disposition = 'ANSWERED' AND ISNULL(did, '') <> '' THEN duration ELSE 0 END AS Duration,
		|	CASE WHEN disposition = 'ANSWERED' AND (LEN(src) = 4 AND LEFT(src, 2) = '27') THEN duration ELSE 0 END AS DurationOutput,
		|	disposition,
		|	lastapp, 
		|	uniqueid
		|INTO #CallsHistory
		|FROM OPENROWSET('MSDASQL','DSN=ASTERISK', 'SELECT * FROM asteriskcdrdb.cdr%УсловиеПериод%')
		|
		|-%WHERE%-
		|
		|CREATE INDEX index_calldate
		|ON #CallsHistory(calldate)
		|
		|CREATE INDEX index_src
		|ON #CallsHistory(src)
		|
		|SELECT LastCalls.src, LastCalls.did, LastCalls.date, LastCalls.CallsQty,
		|	CASE WHEN disposition = 'ANSWERED' THEN 0 ELSE 1 END AS NotAnswered,
		|	disposition AS LastState
		|INTO #LastCalls
		|FROM
		|	(SELECT src, did,
		|		CAST(calldate AS date) AS date,
		|		SUM(CASE WHEN disposition = 'ANSWERED' THEN 0 ELSE 1 END) AS CallsQty,
		|		MAX(calldate) AS LastCall
		|	FROM #CallsHistory
		|	WHERE ISNULL(did, '') <> ''
		|	GROUP BY src, did, CAST(calldate AS date)) AS LastCalls
		|LEFT JOIN #CallsHistory AS CallsHistory
		|ON CallsHistory.calldate = LastCalls.LastCall AND CallsHistory.src = LastCalls.src
		|
		|CREATE INDEX index2_src
		|ON #LastCalls(src)
		|
		|CREATE INDEX index2_did
		|ON #LastCalls(did)
		|
		|CREATE INDEX index2_date
		|ON #LastCalls(date)
		|
		|SELECT
		|	CallsHistory.calldate,
		|	CallsHistory.src, 
		|	CallsHistory.dst,
		|	CallsHistory.did,
		|	CallsHistory.disposition,
		|	CallsHistory.dstchannel,
		|	CallsHistory.Duration,
		|	CallsHistory.DurationOutput,
		|	lastapp,
		|	CallsHistory.uniqueid,
		|	LastCalls.NotAnswered,
		|	LastCalls.CallsQty
		|	
		|FROM
		|	#CallsHistory AS CallsHistory
		|	LEFT JOIN #LastCalls AS LastCalls
		|	ON CallsHistory.src = LastCalls.src AND CallsHistory.did = LastCalls.did AND CAST(CallsHistory.calldate AS date) = LastCalls.date";
	
	УсловиеПериод = "";
	//Отбор по датам
	Если ЗначениеЗаполнено(НачалоПериода) И ЗначениеЗаполнено(КонецПериода) Тогда
		УсловиеПериод = ПолучитьУсловиеМежду("calldate", НачалоПериода, КонецПериода);
	ИначеЕсли ЗначениеЗаполнено(НачалоПериода) Тогда
		УсловиеПериод = "calldate >= " + ВнешниеДанные.ФорматПоля(НачалоПериода, Истина);
	ИначеЕсли ЗначениеЗаполнено(КонецПериода) Тогда
		УсловиеПериод = "calldate <= " + ВнешниеДанные.ФорматПоля(КонецПериода, Истина); 
	КонецЕсли;
	ТекстЗапросаSQL = СтрЗаменить(ТекстЗапросаSQL, "%УсловиеПериод%", ?(ПустаяСтрока(УсловиеПериод), "", " WHERE " + СтрЗаменить(УсловиеПериод, "'", "''")));
	
	//отбор по номеру
	Условие = "";
	Если ЗначениеЗаполнено(ОтборНомераТелефона) Тогда
		//+++АК SHEP 20160512: отбор по списку телефонов
		Если Найти(ОтборНомераТелефона, ",") > 0 Тогда
			ОтборНомераТелефонаSQL = "'" + СтрЗаменить(ОтборНомераТелефона, ",", "','") + "'";
			Условие = ?(ЗначениеЗаполнено(Условие), Условие + " AND ", "") +
				//"(CASE WHEN LEN(src) < 10 THEN src ELSE '8' + RIGHT(src, 10) END IN (" + ОтборНомераТелефонаSQL + ")
				//|	OR CASE WHEN LEN(did) < 10 THEN did ELSE '8' + RIGHT(did, 10) END IN(" + ОтборНомераТелефонаSQL + "))";
				"CASE WHEN LEN(did) < 10 THEN did ELSE '8' + RIGHT(did, 10) END IN(" + ОтборНомераТелефонаSQL + ")";
		Иначе
			Условие = ?(ЗначениеЗаполнено(Условие), Условие + " AND ", "") +
				//"(CASE WHEN LEN(src) < 10 THEN src ELSE '8' + RIGHT(src, 10) END LIKE '" + ОтборНомераТелефона + "' 
				//|	OR CASE WHEN LEN(did) < 10 THEN did ELSE '8' + RIGHT(did, 10) END LIKE '" + ОтборНомераТелефона + "')";
				"CASE WHEN LEN(did) < 10 THEN did ELSE '8' + RIGHT(did, 10) END LIKE '" + ОтборНомераТелефона + "'";
		КонецЕсли;
		Условие =  Условие + "
		|OR (LEN(src) = 4 AND LEFT(src, 2) = '27')";
	КонецЕсли;
	
	
	//
	////отбор по неотвеченным
	//Если ТолькоНеотвеченые = Истина Тогда
	//	Условие = ?(ЗначениеЗаполнено(Условие), Условие + " AND ", "") + "ISNULL(HistoryPhoneBookSrc.LastState,'ANSWERED') <> 'ANSWERED'";
	//КонецЕсли;
	
	//Отбор по времени
	Если ВремяС <> Неопределено ИЛИ ВремяПо <> Неопределено Тогда
		Условие = ?(ЗначениеЗаполнено(Условие), Условие + " AND ", "") +
			"DATEPART(HOUR, calldate) BETWEEN '" + ?(ЗначениеЗаполнено(ВремяС), ВремяС, 0) + "' AND '" + ?(ЗначениеЗаполнено(ВремяПо), ВремяПо - 1, 23) + "'";
	КонецЕсли;
	
	Условие = ?(ЗначениеЗаполнено(Условие), "WHERE ", "") + Условие;
	rs = ADOСоединение.Execute(СтрЗаменить(ТекстЗапросаSQL, "-%WHERE%-", Условие));
	//Сообщить(СтрЗаменить(ТекстЗапросаSQL, "-%WHERE%-", Условие));
	
	ТаблицаНомеровИОбъектов = АК_ТелефонияСервер.ПолучитьТелефоныИОбъекты();
	
	ТабКешПродажи = Новый ТаблицаЗначений();
	ТабКешПродажи.Колонки.Добавить("Картинка");
	ТабКешПродажи.Колонки.Добавить("ВходящийПредставление");
	ТабКешПродажи.Колонки.Добавить("ВходящийОбъект");
	ТабКешПродажи.Колонки.Добавить("ИсходящийПредставление");
	ТабКешПродажи.Колонки.Добавить("ИсходящийОбъект");
	
	Попытка
		Пока НЕ rs = Неопределено Цикл
			Если rs.Fields.Count > 0 Тогда
				Для Каждого Field Из rs.Fields Цикл
					МассивТипов = Новый Массив;
					Если Field.Value = Null Тогда
						ТипValue = Тип("Строка");
					Иначе
						ТипValue = ТипЗнч(Field.Value);
					КонецЕсли;
					МассивТипов.Добавить(ТипValue);
					ТабКешПродажи.Колонки.Добавить(Field.Name, Новый ОписаниеТипов(МассивТипов));
				КонецЦикла;
				Прервать;
			КонецЕсли;
			rs = rs.NextRecordSet();
		КонецЦикла;
		
		Пока НЕ rs.EOF() Цикл
			СтруктураСтроки = Новый Структура();
			Для Каждого Field Из rs.Fields Цикл
				СтруктураСтроки.Вставить(Field.Name,Field.Value);
			КонецЦикла;
			
			//СтруктураСтроки.src = ОчиститьНомерТелефона(СтруктураСтроки.src);
			//СтруктураСтроки.dst = ОчиститьНомерТелефона(СтруктураСтроки.dst);
			
			Если Не ЗначениеЗаполнено(СтруктураСтроки.src)
				И Не ЗначениеЗаполнено(СтруктураСтроки.dst) Тогда
				rs.MoveNext();
				Продолжить;
			КонецЕсли;
			
			СтрокаДоб = ТабКешПродажи.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДоб,СтруктураСтроки);
			
			//СтрокаДоб.Картинка = ?(СтрДлина(СтрокаДоб.src)>5,0, ?(СтрДлина(СтрокаДоб.dst)>5,1,0));
			
			//Если ЗначениеЗаполнено(СтрокаДоб.CustomerUIDsrc) Тогда
			//	СтрокаДоб.ВходящийОбъект = СтрокаДоб.CustomerUIDsrc;
			//	СтрокаДоб.ВходящийПредставление = СтрокаДоб.FullNamesrc + " (" + СтрокаДоб.src + ")";
			//Иначе
			Если ЗначениеЗаполнено(СтруктураСтроки.did) Тогда
				СтрокаТелефон = ТаблицаНомеровИОбъектов.Найти(СтрокаДоб.src, "НомерТелефона");
				Если СтрокаТелефон = Неопределено Тогда
					СтрокаДоб.ВходящийОбъект = "";
					СтрокаДоб.ВходящийПредставление = СтрокаДоб.src;
				Иначе
					СтрокаДоб.ВходящийОбъект = СтрокаТелефон.ОбъектТелефона;
					СтрокаДоб.ВходящийПредставление = Строка(СтрокаТелефон.ОбъектТелефона) + " (" + СтрокаДоб.src + ")";
				КонецЕсли;
			Иначе
				СтрокаТелефон = ТаблицаНомеровИОбъектов.Найти(СтрокаДоб.dst, "НомерТелефона");
				Если СтрокаТелефон = Неопределено Тогда
					СтрокаДоб.ИсходящийОбъект = "";
					СтрокаДоб.ИсходящийПредставление = СтрокаДоб.dst;
				Иначе
					СтрокаДоб.ИсходящийОбъект = СтрокаТелефон.ОбъектТелефона;
					СтрокаДоб.ИсходящийПредставление = Строка(СтрокаТелефон.ОбъектТелефона) + " (" + СтрокаДоб.dst + ")";
				КонецЕсли;
			КонецЕсли;			
			
			//Если ЗначениеЗаполнено(СтрокаДоб.CustomerUIDdst) Тогда
			//	СтрокаДоб.ИсходящийОбъект = СтрокаДоб.CustomerUIDdst;
			//	СтрокаДоб.ИсходящийПредставление = СтрокаДоб.FullNamedst + " (" + СтрокаДоб.dst + ")";
			//Иначе
				//СтрокаТелефон = ТаблицаНомеровИОбъектов.Найти(СтрокаДоб.did, "НомерТелефона");
				//Если СтрокаТелефон <> Неопределено Тогда
				//	СтрокаДоб.ВходящийОбъект = СтрокаТелефон.ОбъектТелефона;
				//	СтрокаДоб.ВходящийПредставление = Строка(СтрокаТелефон.ОбъектТелефона) + " (" + СтрокаДоб.did + ")";
				//Иначе
				//	СтрокаДоб.ВходящийОбъект = "";
				//	СтрокаДоб.ВходящийПредставление = СтрокаДоб.did;
				//КонецЕсли;			
			//КонецЕсли;			
			rs.MoveNext();
		КонецЦикла;
	Исключение
		Текст = ОписаниеОшибки();
	КонецПопытки;

	ADOСоединение.Close();
	
	Если ТабКешПродажи.Колонки.Найти("calldate") <> Неопределено Тогда
		ТабКешПродажи.Сортировать("calldate Убыв");
	КонецЕсли;
	
	Возврат ТабКешПродажи;
	
КонецФункции
